In [ ]:
1) Pandas : Data frame applications

2)Numpy   : Numerical python All math applications

3)Matplotlib : Used for plotting

4)Seaborn :Used for plot

5)Plotly: Use for Plot

6) Bokhe: plot

ML

7) Sickit-learn : sklearn

DP

8)Tensorflow :Google

9)Keras: Google

10)pytorch : Facebook

NLP

11)NLTK : NAtural languague tool kit

12)Scipy  

BERT

13) Transformers : Hugging face(google)

GOOGLE MODELS

14)Specific google packages

Azure ML

15)Azure packages

GanAI

16)Gamini: Google

17)ChatGPT : OpeanAI

LangChain

18)LangChain Packages

**create a Dataframe using list**

In [1]:
import pandas as pd
names=['Ayush','Avinash','Akash']
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [2]:
names=['Ayush','Avinash','Akash']
pd.DataFrame(names)

         0
0    Ayush
1  Avinash
2    Akash

In [8]:
names=['Ayush','Avinash','Akash']
age=[20,25,30]
slary=[10000,20000,39000]
pd.DataFrame(zip(names,age,slary))

         0   1      2
0    Ayush  20  10000
1  Avinash  25  20000
2    Akash  30  39000

In [10]:
names=['Ayush','Avinash','Akash']
age=[20,25,30]

pd.DataFrame(zip(names,age),
             columns=['Names','age'])

     Names  age
0    Ayush   20
1  Avinash   25
2    Akash   30

In [12]:
names=['Ayush','Avinash','Akash']
age=[20,25,30]
slary=[10000,20000,39000]
pd.DataFrame(zip(names,age,slary),
             columns=['Names','age','slary'])

     Names  age  slary
0    Ayush   20  10000
1  Avinash   25  20000
2    Akash   30  39000

In [13]:
names=['Ayush','Avinash','Akash']
age=[20,25,30]
slary=[10000,20000,39000]
data=zip(names,age,slary)
cols=['Name','Age','slary']
pd.DataFrame(data,columns=cols)

      Name  Age  slary
0    Ayush   20  10000
1  Avinash   25  20000
2    Akash   30  39000

In [14]:
names=['Ayush','Avinash','Akash']
age=[20,25,30]
slary=[10000,20000,39000]
data=zip(names,age,slary)
cols=['Name','Age','slary']
df=pd.DataFrame(data,columns=cols)
type(df)

pandas.core.frame.DataFrame

**ADD new column**

In [ ]:
-If you want to add new column

In [18]:
job=['DS','DE','CS']
df['Job']=job
df

      Name  Age  slary Job
0    Ayush   20  10000  DS
1  Avinash   25  20000  DE
2    Akash   30  39000  CS

In [19]:
city=['HY','BR','MU']
df['City']=city
df

      Name  Age  slary Job City
0    Ayush   20  10000  DS   HY
1  Avinash   25  20000  DE   BR
2    Akash   30  39000  CS   MU

In [20]:
df['Age']=[40,50,60]
df

      Name  Age  slary Job City
0    Ayush   40  10000  DS   HY
1  Avinash   50  20000  DE   BR
2    Akash   60  39000  CS   MU

In [23]:
#step-6
names=['Ayush','Avinash','Akash','Kanhu']
age=[20,25,30,40]
slary=[10000,20000,39000,40000]
data=zip(names,age,slary)
cols=['Name','Age','slary']
idx=['A','B','C','D']
df=pd.DataFrame(data,index=idx,columns=cols)
df

      Name  Age  slary
A    Ayush   20  10000
B  Avinash   25  20000
C    Akash   30  39000
D    Kanhu   40  40000

In [3]:
names=['Ayush','Avinash','Akash','Kanhu']
age=[20,25,30,40]
slary=[10000,20000,39000,40000]
city=['HY','BR','MU',]
data=zip(names,age,slary,city)
cols=['Name','Age','slary','City']
idx=['A','B','C','D']
df=pd.DataFrame(data,index=idx,columns=cols)
df

ValueError: Length of values (3) does not match length of index (4)

In [27]:
df.shape
print("The number of rows are:",df.shape[0])
print("The number of columns are:",df.shape[1])

The number of rows are: 4
The number of columns are: 3

**step-8**
### How to drop the column

- In order to drop column we required 3 arguments

-

In [28]:
df

      Name  Age  slary
A    Ayush   20  10000
B  Avinash   25  20000
C    Akash   30  39000
D    Kanhu   40  40000

In [30]:
df.drop('slary',
        axis=1,
        inplace=True)

In [31]:
df

      Name  Age
A    Ayush   20
B  Avinash   25
C    Akash   30
D    Kanhu   40

In [32]:
df1=df.drop('Age',axis=1)

In [33]:
df

      Name  Age
A    Ayush   20
B  Avinash   25
C    Akash   30
D    Kanhu   40

In [34]:
df1

      Name
A    Ayush
B  Avinash
C    Akash
D    Kanhu

In [35]:
names=['Ayush','Avinash','Akash','Kanhu']
age=[20,25,30,40]
slary=[10000,20000,39000,40000]
data=zip(names,age,slary)
cols=['Name','Age','slary']
idx=['A','B','C','D']
df=pd.DataFrame(data,index=idx,columns=cols)
df

      Name  Age  slary
A    Ayush   20  10000
B  Avinash   25  20000
C    Akash   30  39000
D    Kanhu   40  40000

In [36]:
df.drop('slary',axis=1,inplace=True)

In [37]:
df

      Name  Age
A    Ayush   20
B  Avinash   25
C    Akash   30
D    Kanhu   40

In [38]:
df.drop('Age',axis=1)

      Name
A    Ayush
B  Avinash
C    Akash
D    Kanhu

In [39]:
df

      Name  Age
A    Ayush   20
B  Avinash   25
C    Akash   30
D    Kanhu   40

In [40]:
#
names=['Ayush','Avinash','Akash','Kanhu']
age=[20,25,30,40]
slary=[10000,20000,39000,40000]
data=zip(names,age,slary)
cols=['Name','Age','slary']
idx=['A','B','C','D']
df=pd.DataFrame(data,index=idx,columns=cols)
df

      Name  Age  slary
A    Ayush   20  10000
B  Avinash   25  20000
C    Akash   30  39000
D    Kanhu   40  40000

In [41]:
df.drop(['Age','slary'],axis=1,inplace=True)
df

      Name
A    Ayush
B  Avinash
C    Akash
D    Kanhu

In [8]:
names=['Ayush','Avinash','Akash','Kanhu']
age=[20,25,30,40]
slary=[10000,20000,39000,40000]
data=zip(names,age,slary)
cols=['Name','Age','slary']
idx=['A','B','C','D']
df=pd.DataFrame(data,index=idx,columns=cols)
df

      Name  Age  slary
A    Ayush   20  10000
B  Avinash   25  20000
C    Akash   30  39000
D    Kanhu   40  40000

In [4]:
df.drop('slary',axis=0,inplace=True)

NameError: name 'df' is not defined

In [9]:
df.drop('D',axis=0,inplace=True)
df

      Name  Age  slary
A    Ayush   20  10000
B  Avinash   25  20000
C    Akash   30  39000

In [10]:
#step-11
df.to_csv('data.csv')

In [13]:
df.to_excel('data2.xlsx')